/** .-----------------------------------------------------------------------------------------------------------------
 * |  Github: https://github.com/Tinywan
 * |  Blog: http://www.cnblogs.com/Tinywan
 * |-------------------------------------------------------------------------------------------------------------------
 * |  Author: Tinywan(ShaoBo Wan)
 * |  DateTime: 2017/12/26 10:20
 * |  Mail: Overcome.wan@Gmail.com
 * '------------------------------------------------------------------------------------------------------------------*/

/**
 callback即为模块加载完毕的回调函数，它返回一个exports参数，用于输出该模块的接口。
 **/
// 定义一个模块的时候，声明该模块所需的依赖,['layer', 'laypage']即为本模块所依赖的模块，它并非只能是一个数组，你也可以直接传一个字符型的模块名，但是这样只能依赖一个模块
layui.define(['layer', 'form'], function(exports){
    var layer = layui.layer
        ,form = layui.form;
    //接受两个参数，第一个参数为模块名，第二个参数为模块接口
    exports('index2', function () { //注意，这里是模块输出的核心，模块名必须和use时的模块名一致
        alert('Hello World!');
    });
});